app/controllers/actors_controller.rb

  def index
    @actors = Actor.all
---
SELECT * FROM `actors`

  def show
    @actor = Actor.find(params[:id])
---
SELECT * FROM `actors` WHERE (`actors`.`id` = 1)

  def edit
    @actor = Actor.find(params[:id])
---
SELECT * FROM `actors` WHERE (`actors`.`id` = 1)

  def create
    @actor = Actor.new(params[:actor])

    respond_to do |format|
      if @actor.save
---
INSERT INTO `actors` (`updated_at`, `actor_name`, `created_at`) VALUES('2009-05-12 16:02:11', 'Jean', '2009-05-12 16:02:11')

  def update
    @actor = Actor.find(params[:id])
---
SELECT * FROM `actors` WHERE (`actors`.`id` = 1)