app/controllers/shots_controller.rb

  def displayall
    @shots = Shot.all
---
SELECT * FROM `shots`

  def results
    @tape_id = params[:tape_id]
    if !@tape_id.nil?
      @shots = Shot.find(:all, :conditions => { :tape_id => @tape_id })
---
SELECT * FROM `shots` WHERE (`shots`.`tape_id` = 'd')

  def rss
    # Get the 10 most recent photos
    @shots = Shot.find :all, :limit => 5
---
SELECT * FROM `shots` LIMIT 2

  def show
    @shot = Shot.find(params[:id])
---
SELECT * FROM `shots` WHERE (`shots`.`id` = 0)

  def new
    @shot = Shot.new
    @universities = University.all
---
SELECT * FROM `universities`

  def edit
    @shot = Shot.find(params[:id])
---
SELECT * FROM `shots` WHERE (`shots`.`id` = 1)

  def create
    @shot = Shot.new(params[:shot])

    respond_to do |format|
      if @shot.save
---
INSERT INTO `shots` (`actors`, `updated_at`, `shot_in`, `country`, `topic`, `tape_id`, `shot_out`, `campus`, `province`, `location`, `keywords`, `created_at`) VALUES('john', '2009-05-13 16:35:37', '2009-05-13 16:35:00', 'Canada', '', 'tapeX', '2009-05-13 16:35:00', 'UWO', 'Ontario', 'student center', 'test', '2009-05-13 16:35:37')

  def update
    @shot = Shot.find(params[:id])

    respond_to do |format|
      if @shot.update_attributes(params[:shot])
---
SELECT * FROM `shots` WHERE (`shots`.`id` = 6)
UPDATE `shots` SET `keywords` = 'fdfddfd', `updated_at` = '2009-05-17 01:00:36' WHERE `id` = 6

  def destroy
    @shot = Shot.find(params[:id])
    @shot.destroy
---
SELECT * FROM `shots` WHERE (`shots`.`id` = 3)
DELETE FROM `shots` WHERE `id` = 3